Revit 2027 API
ParameterTypeId.PropertyAreaUnits Property
 "Area Units, Format"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PropertyAreaUnits { get; }
Public Shared ReadOnly Property PropertyAreaUnits As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PropertyAreaUnits {
	ForgeTypeId^ get ();
}
static member PropertyAreaUnits : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace